In [34]:
#Задание 1

import numpy as np
import pandas as pd

r = np.random.RandomState(1)
s = pd.Series(r.uniform(0, 10, 100))
s = s.sort_values()
s[s > 5][:1]

67    5.148891
dtype: float64

In [51]:
#Задание 2

df = pd.DataFrame({
    'имя': ['Петя', 'Вася', 'Аня', 'Света'],
    'возраст': [45, 26, 41 , 21],
    'доход': [100000, 80000, 150000, 60000],
    'надежность клиента': [0.65, 0.74, 0.87, 0.68],
    'пол': ['муж', 'муж', 'жен', 'жен']},
    index=[0, 1, 2, 3])
print(df[df['возраст']>40])
a = df['доход']<df['доход'].mean()
b = df['доход']>df['доход'].mean()
c = df['надежность клиента']<df['надежность клиента'].mean()
print('\n')
print(df[a])
print('\n')
print(df[b&c])
df['важность клиента'] = df['доход']*df['надежность клиента']
df['возможная долгосрочность клиента'] = df['важность клиента'] *(df['возраст'].mean() - df['возраст'])
df

    имя  возраст   доход  надежность клиента  пол
0  Петя       45  100000                0.65  муж
2   Аня       41  150000                0.87  жен


     имя  возраст  доход  надежность клиента  пол
1   Вася       26  80000                0.74  муж
3  Света       21  60000                0.68  жен


    имя  возраст   доход  надежность клиента  пол
0  Петя       45  100000                0.65  муж

     имя  возраст  ...  важность клиента  возможная долгосрочность клиента
0   Петя       45  ...           65000.0                         -763750.0
1   Вася       26  ...           59200.0                          429200.0
2    Аня       41  ...          130500.0                        -1011375.0
3  Света       21  ...           40800.0                          499800.0

[4 rows x 7 columns]

In [57]:
#Задание 3

import pandas as pd
import numpy as np

df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['low', 'medium', 'high'] * 3,
                    'price': np.random.randint(0, 100, 9)})

df2 = pd.DataFrame({'frukt': ['apple', 'banana', 'melon'] * 2,
                    'ves': ['low', 'high'] * 3,
                    'price': np.random.randint(0, 100, 6)})

df1 = pd.concat([df1, df2], axis=0, join="outer", ignore_index=True, verify_integrity=True)
df1 = df1.drop(columns=['ves', 'frukt'], inplace=False)
df1

     fruit  weight  price
0    apple     low     21
1   banana  medium     83
2   orange    high     25
3    apple     low     19
4   banana  medium     73
5   orange    high     89
6    apple     low     70
7   banana  medium      7
8   orange    high     47
9      NaN     NaN     65
10     NaN     NaN     11
11     NaN     NaN     91
12     NaN     NaN     97
13     NaN     NaN     10
14     NaN     NaN     85